#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 08: Klassen
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXI}{C++11\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* Strukturen
\vspace{1.7em}
\small
#+header: :exports both :results output :tangle src/structs.cpp :flags -std=c++1y
#+BEGIN_SRC C++
#include <iostream>  // structs.cpp
using namespace std;

struct Circle {
    double r{1};
    double x{};
    double y;
};

int main() {
    Circle c;  // it's a "POD" (plain old data type)!
    // therefore, no initialization!
    cout << c.r <<  ' ' << c.x << ' ' << c.y << endl;
    c = Circle{3, 2, 1};
    cout << c.r <<  ' ' << c.x << ' ' << c.y << endl;
}
#+END_SRC

#+RESULTS:
: 1 0 6.95291e-310
: 3 2 1

* Strukturen - 2
\vspace{1.7em}
\small
#+header: :exports both :results output :tangle src/structs2.cpp :flags -std=c++1y
#+BEGIN_SRC C++
#include <iostream>  // structs2.cpp
using namespace std;

// convention: use struct for simple aggregates
struct Point {
    double x;
    double y;
};

int main() {
    Point p{};// also a POD but initialized explicitly
    cout << p.x <<  ' ' << p.y << endl;
    Point points[]{{}, {1, 1}, {2, {}}};
    cout << points[0].x <<  ' ' << points[1].x << ' '
      << points[2].x << endl;
}
#+END_SRC

#+RESULTS:
: 0 0
: 0 1 2


* Strukturen - 3
\vspace{1.7em}
\small
#+header: :exports both :results output :tangle src/structs3.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // structs3.cpp
using namespace std;

// should be inside .h file
struct Counter {
    static int cnt;
};

// should be inside .cpp file
int Counter::cnt{};
// without -> undefined reference to `Counter::cnt'

int main() {
    cout << ++Counter::cnt << endl;
}
#+END_SRC

#+RESULTS:
: 1

* Strukturen - 4
\vspace{1.7em}
\small
#+header: :exports both :results output :tangle src/structs4.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // structs4.cpp
using namespace std;

struct Counter {
    inline static int cnt;
    // implicitly inline:
    constexpr static double pi{3.1415};
};

// Neither definition of cnt nor pi!

int main() {
    cout << ++Counter::cnt << endl;
    cout << Counter::pi << endl;
}
#+END_SRC

#+RESULTS:
: 1
: 3.1415

* Einfache Klasse
\vspace{1.7em}
\footnotesize
#+header: :exports both :results output :tangle src/simpleclass.cpp :flags -std=c++1y
#+BEGIN_SRC C++
#include <iostream>  // simpleclass.cpp
#include <tuple>
using namespace std;
class Circle {
    double r{1};  double x;  double y;
  public:
    Circle()=default;  // no POD!
    Circle(double r, double x, double y)
      : r{r}, x{x}, y{y} {}
    auto data() const { return make_tuple(r, x, y); } };
int main() {
    auto [r, x, y] = Circle{}.data();
    cout << r <<  ' ' << x << ' ' << y << ", ";
    tie(r, x, y) = Circle{3, 2, 1}.data();
    cout << r <<  ' ' << x << ' ' << y << ", ";
    auto circ = Circle{3, 2, 1}.data();
    cout << get<0>(circ) << ' ' << get<1>(circ) << ' '
      << get<2>(circ)<<endl;
}
#+END_SRC
#+RESULTS:
: 1 0 0, 3 2 1, 3 2 1

* Direct vs. Copy -- 2
\vspace{1.5em}
\small
#+header: :exports both :results none :tangle src/directcopy2.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // directcopy2.cpp
using namespace std;
class Distance {  double len;
  public:
    Distance()=default;
    explicit Distance(double len)
      : len{len} { cout << "ctor" << endl; }
    Distance(const Distance& other) : len{other.len} {
        cout << "copy ctor" << endl;  }
    ~Distance() { cout << "dstor" << endl; }  };
int main() {
    Distance d1;
    Distance d2{1};  // direct init
    // copy init -> compiler error because of explicit
    // Distance d3 = 2;
} // C++17: *no* output of "copy ctor"
#+END_SRC

#+RESULTS:
: ctor
: dstor
: dstor

* Direct vs. Copy -- 3
\vspace{1.5em}
\small
#+header: :exports both :results output :tangle src/directcopy3.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // directcopy3.cpp
#include <initializer_list>
using namespace std;
class Distance {
    double len{};
  public:
    Distance(double len)
      : len{len} { cout << "ctor" << endl; }
    Distance(initializer_list<double> l)
      : len{*l.begin()} {
        cout << "initializer ctor" << endl;  }
    ~Distance() { cout << "dtor" << endl; }  };
int main() {
    Distance d1{1};  Distance d2 = {1};  }
#+END_SRC

#+RESULTS:
: initializer ctor
: initializer ctor
: dtor
: dtor

* RVO -- 2
\vspace{1.5em}
\small
#+header: :exports both :results output :tangle src/rvo1.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // rvo1.cpp
using namespace std;
class Distance {
    double len{};
  public:
    Distance(double len)
      : len{len} { cout << "ctor" << endl; }
    Distance(const Distance& other) : len{other.len} {
        cout << "copy ctor" << endl;  }
    ~Distance() {  cout << "dtor" << endl;  }  };
Distance one() { return Distance{1}; }
int main() {
    Distance d2{one()};  // direct init
    Distance d3=one();  // copy init
}
#+END_SRC

#+RESULTS:
: ctor
: ctor
: dtor
: dtor

* RVO -- 3
\vspace{1.5em}
\small
#+header: :exports both :results output :tangle src/rvo2.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // rvo2.cpp
using namespace std;
class Distance {
    double len{};
  public:
    Distance(double len)
      : len{len} { cout << "ctor" << endl; }
    Distance(const Distance& other) : len{other.len} {
        cout << "copy ctor" << endl;  }
    ~Distance() {  cout << "dtor" << endl;  }  };
Distance one() {
    Distance res{1};
    return res; }
int main() { Distance d2{one()};
             Distance d3=one();  }
#+END_SRC

#+RESULTS:
: ctor
: ctor
: dtor
: dtor

* RVO -- 4
\vspace{1.5em}
\small
#+header: :exports both :results output :tangle src/rvo3.cpp :flags -std=c++17
#+BEGIN_SRC C++
#include <iostream>  // rvo3.cpp
using namespace std;
class Distance {
    double len{};
  public:
    Distance(double len)
      : len{len} { cout << "ctor" << endl; }
    Distance(const Distance& other) : len{other.len} {
        cout << "copy ctor" << endl;  }
};
void one(Distance d) {
    cout << "inside one" << endl; }
int main() {
    one(Distance{1});
}
#+END_SRC

#+RESULTS:
: ctor
: inside one

